/**********************************************/
/*　　　　   dn1.cプログラム                  */
/**********************************************/

/*    テストデータジェネレータ                */
/*   正方形領域，一辺が波打っている場合(fig12)*/


#include <stdio.h>
#include <math.h>


#define N 101 /*x軸方向の分割数*/
#define M 101 /*y軸方向の分割数*/

/*関数のプロトタイプの宣言*/

/*********************/
/*     main()関数    */
/*********************/
int main()
{
 int i,j ;
 double u;

 /*1行目*/
 u=0 ;
 for(i=0;i<N;++i){
  printf("%lf\n",u) ;
  u=sin((double)i/N*2*M_PI);
 }
 /*2行目から101行目*/
 for(j=1;j<M;++j){
  for(i=0;i<N;++i)
   printf("0\n") ;
 } 
}
