/**********************************************/
/*　　　　   gauss.cプログラム                */
/**********************************************/

/*    ガウスの消去法                          */
/*  ガウスの消去法で連立方程式を解くプログラム*/

#include <stdio.h>
#include <math.h>

#define N 9 /*N元連立方程式を解く*/


/*関数のプロトタイプの宣言*/
void forward(double r[][N+1]) ;/*前進消去*/
void backward(double r[][N+1],double x[N]) ;/*後退代入*/

/*********************/
/*     main()関数    */
/*********************/
int main()
{
 double r[N][N+1] /*拡大係数行列*/
  ={{4,-1,0,-1,0,0,0,0,0,0},{-1,4,-1,0,-1,0,0,0,0,0},
    {0,-1,4,0,0,-1,0,0,0,0.25},{-1,0,0,4,-1,0,-1,0,0,0},
    {0,-1,0,-1,4,-1,0,-1,0,0},{0,0,-1,0,-1,4,0,0,-1,0.5},
    {0,0,0,-1,0,0,4,-1,0,0.25},{0,0,0,0,-1,0,-1,4,-1,0.5},
    {0,0,0,0,0,-1,0,-1,4,1.5}} ;
 double x[N] ;/*未知変数*/
 int i,j ;

 /*前進消去*/
 forward(r) ;
 /* 後退代入*/
 backward(r,x) ;
 /*結果の出力*/
 for(i=0;i<N;++i){
  for(j=0;j<N+1;++j)
    printf("%lf ",r[i][j]) ;
  printf("\n") ;
 }
 for(i=0;i<N;++i) 
  printf("%lf\n",x[i]) ;
 
 return 0 ;
}

/*************************/
/*     forward(()関数    */
/*       前進消去        */
/*************************/
void forward(double r[][N+1])
{
 double rii,rki ;/*計算過程で用いる一時変数*/
 int i,j,k ;

 for(i=0;i<N;++i){/*すべての行を計算*/
  rii=r[i][i] ;
  for(j=i;j<N+1;++j)
   r[i][j]/=rii ;/*行iの係数をriiで割る*/
  for(k=i+1;k<N;++k){/*i+1行以下の処理*/
   rki=r[k][i] ;
   for(j=i;j<N+1;++j)
    r[k][j]=r[k][j]-r[i][j]*rki ;/*先頭項の消去*/
  }
 }
}

/*************************/
/*    backward(()関数    */
/*      後退代入         */
/*************************/
void backward(double r[][N+1],double x[N]) 
{
 double sum ;/*計算過程で用いる一時変数*/
 int i,j ;

 for(i=N-1;i>=0;--i){/*行列の下段から上段に向けて逐次代入*/
  sum=0 ;
  for(j=i+1;j<N;++j)
   sum+=r[i][j]*x[j] ;/*各項の和*/
  x[i]=r[i][N]-sum ;/*xiの計算*/
 }
}
