/**********************************************/
/*　　　　   error3.cプログラム               */
/**********************************************/

/*計算誤差の例題プログラム          　　    　*/
/*情報落ち誤差の例題です                      */

#include <stdio.h>

int main()
{
 double x=1e10,y=1e-8,temp=0.0 ;
 int i ;

 /*y(1e-8)をx(1e10)に10000000回加える*/
 for(i=0;i<10000000;++i)
  x=x+y ;
 printf("%f\n",x) ;

 /*先にy(1e-8)を10000000回加える*/
 for(i=0;i<10000000;++i)
  temp+=y ; 
 /*加えた結果をx(1e10)に加える*/
 x=1e10 ;
 x+=temp ;
 printf("%f\n",x) ;

 return 0 ;
}
