/*********************************************/
/*　　　　         r.cプログラム             */
/*********************************************/

/* 擬似乱数生成プログラム                     */
/* 線形合同法による擬似乱数生成プログラムです */
/*　使い方    $./r (初期値）                  */

#include <stdio.h>
#include <stdlib.h>

#define LIMIT 50 /*生成する乱数の個数*/

/*********************/
/*     main()関数    */
/*********************/
int main(int argc,char *argv[])
{
 unsigned long r ;/*乱数*/
 int i ;

 /*初期値の設定*/
 if(argc<2){/*初期値の指定がない*/
  fprintf(stderr,"使い方　r (初期値）　\n") ;
  exit(1) ;
 } 
 sscanf(argv[1],"%lu",&r) ;

 /*乱数の生成*/
 for(i=0;i<LIMIT;++i){
  r=1664525L*r+1013904223L ;
  printf("%lu\n",r) ;
 }

 return 0 ;
}
